# MinorNumberOfWires Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..MinorNumberOfWires Property
FabricSheetType Class See Also
---
The number of wires used in the minor direction (includes the 1st and last wires).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int MinorNumberOfWires { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MinorNumberOfWires As Integer
	Get
```

Visual C++
---
```text
public:
property int MinorNumberOfWires {
	int get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace